In [1]:

from __future__ import (absolute_import, division,
                        print_function, unicode_literals)

import warnings
warnings.simplefilter('ignore')

import seaborn as sns
import pandas as pd

# Занятие 2. Библиотеки и инструменты для анализа данных. Математика в машинном обучении

## Практическое задание. Анализ данных пассажиров "Титаника"

<center>
<img src="../../img/beeline_data_school_logo.png">
# "Прикладной анализ данных"
#### Интенсивный курс по изучению машинного обучения и анализа данных
<img src="../../img/beeline_logo.jpg" height="240" width="240">
## Авторы материала: преподаватель Факультета Компьютерных Наук НИУ ВШЭ Кашницкий Юрий и руководитель совместных проектов Яндекса и CERN Андрей Устюжанин
</center>
Материал распространяется на условиях лицензии <a href="https://opensource.org/licenses/MS-RL">Ms-RL</a>. Можно использовать в любых целях, кроме коммерческих, но с обязательным упоминанием автора материала.

Считаем данные из файла в память в виде объекта Pandas.DataFrame

In [3]:
data = pd.read_csv('/Users/egortarasenok/Desktop/titanic_test.csv')

**Данные представлены в виде таблицы. Посмотрим на первые 5 строк:**

In [5]:
data.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

**Возьмем первые 10 элементов столбца Parch - количество родителей и детей пассажира на борту:**

In [6]:
data['Parch'][:10]

0    0
1    0
2    0
3    0
4    1
5    0
6    0
7    1
8    0
9    0
Name: Parch, dtype: int64

**Отберем пассажиров, которые сели в Cherbourg (Embarked=C) и заплатили более 200 у.е. (fare > 200).**

Убедитесь, что Вы понимаете, как эта конструкция работает. <br />
Если нет - посмотрите, как вычисляется выражение в квадратных в скобках.

In [12]:
data[(data['Embarked'] == 'C') & (data['Fare'] > 100) & (data['Age']<15)]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
64,956,1,"Ryerson, Master. John Borie",male,13.0,2,2,PC 17608,262.375,B57 B59 B63 B66,C
196,1088,1,"Spedden, Master. Robert Douglas",male,6.0,0,2,16966,134.500,E34,C

**1. Сколько мужчин / жещин находилось на борту?**

In [6]:
# Ваш код здесь

**2. Выведите рапределение по переменной Pclass (социально-экономический статус). Дополнительно - это же распределение только для мужчин / женщин.**

In [7]:
# Ваш код здесь

**3. Сколько в среднем заплатил один пассажир? Найдите дисперсию этой величины. Сколько все пассажиры заплатили в сумме?**

In [8]:
# Ваш код здесь

**4. Правда ли, что молодые выживали чаще (с большей вероятностью), чем старики? Пусть "молодые" - те, кто моложе 30, а "старики" - те, кто старше 60.**

In [9]:
# Ваш код здесь

**5. Правда ли, что женщины выживали чаще мужчин?**

In [10]:
# Ваш код здесь

**6. Какое самое популярное имя среди пассажиров Титаника мужского пола?**

In [11]:
# Ваш код здесь

**7. Сравните распределение стоимости билетов у спасенных и у погибших.**

In [12]:
# Ваш код здесь

**8. Как отличается средний возраст мужчин / женщин в зависимости от класса обслуживания?**

In [13]:
# Ваш код здесь